---
title: RepeatingReferenceSource
classe: Autodesk.Revit.DB.RepeatingReferenceSource
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# RepeatingReferenceSource

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int32 DimensionCount { get; }` | `repeatingReferenceSource.DimensionCount` | Int32 |
| `Boolean IsValidObject { get; }` | `repeatingReferenceSource.IsValidObject` | Boolean |
| `Void Dispose()` | `repeatingReferenceSource.Dispose()` | Void |
| `RepeaterBounds GetBounds()` | `repeatingReferenceSource.GetBounds()` | RepeaterBounds |
| `RepeatingReferenceSource GetDefaultRepeatingReferenceSource(Document, ElementId)` | `RepeatingReferenceSource.GetDefaultRepeatingReferenceSource(document, elementId)` | RepeatingReferenceSource |
| `Reference GetReference(RepeaterCoordinates)` | `repeatingReferenceSource.GetReference(coordinates)` | Reference |
| `Boolean HasRepeatingReferenceSource(Document, ElementId)` | `RepeatingReferenceSource.HasRepeatingReferenceSource(document, elementId)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```